-- Create from VipReward.xlsx by 'VipReward.exe' script tool.
-- Version별 이벤트 기간은 DB에서 설정되어 관리됨.
-- 신규보상 사용여부 및 금액보상 사용여부도 DB에서 설정되어 관리됨.

NEWBIE_REWARD = 0 -- 신규보상 그룹
VIP_REWARD    = 1 -- 금액보상
RewardItem = {
	{
		Type = NEWBIE_REWARD,
		-- { RewardID, ItemList = { { ItemID, Count, Period }, ... } },
		Reward = {
			{ RewardID = 1, ItemList = { { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, } },
			{ RewardID = 2, ItemList = { { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, } },
			{ RewardID = 3, ItemList = { { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, } },
			{ RewardID = 4, ItemList = { { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, } },
			{ RewardID = 5, ItemList = { { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, { 540654, -1, -1 }, } },
		}
	},
	{
		Type = VIP_REWARD,
		-- { RewardID, ItemList = { { ItemID, Count, Period }, ... } },
		Reward = {
			{ RewardID = 1, ItemList = { {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, } },
			{ RewardID = 2, ItemList = { {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, } },
			{ RewardID = 3, ItemList = { {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, } },
			{ RewardID = 4, ItemList = { {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, } },
			{ RewardID = 5, ItemList = { {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, {540654,-1,-1}, } },
		}
	},
}

-- 사용금액 범위
PayTable = {
	-- Index, Min, Max (ex.Min원 이상~Max원 미만)
	{1,5000,10000},
	{2,10000,15000},
	{3,15000,20000},
	{4,20000,25000},
	{5,25000,30000},
	{6,30000,35000},
	{7,35000,40000},
	{8,40000,45000},
	{9,45000,50000},
	{10,50000,55000},
}

-- 버전별 구매보상
-- Newbie : 신규유저 구매보상(NEWBIE_REWARD)
-- VIP : 금액구간별 구매보상(VIP_REWARD)
RewardByVer = {
	{
		Ver = 1,
		Newbie = 3,
		VIP = {
			-- { PayTableID, RewardID }
			{ 1, 1 },
			{ 2, 2 },
			{ 3, 3 },
			{ 4, 4 },
			{ 5, 5 },
			{ 6, 6 },
			{ 7, 7 },
		},
	},
	{
		Ver = 2,
		Newbie = 2,
		VIP = {
			-- { PayTableID, RewardID }
			{ 1, 2 },
		},
	},
	{
		Ver = 3,
		Newbie = 1,
		VIP = {
		},
	},
}
