VIPItemInfo =
{
	--[[
    {
        CharType = -1, -- 공용(안씀)
        ItemList =
        {
            --{ 31730, 2 }, -- 크라운 스타
        }
    },
	--]]
    {
        CharType = 0, -- 엘리시스
        ItemList =
        {
			{ 126030, 1 }, -- 켈베로스 검
			{ 126050, 1 }, -- 켈베로스 대검
			{ 98540, 1 }, -- 켈베로스 마스크
			{ 98610, 1 }, -- 켈베로스 쉴드
			{ 98680, 1 }, -- 켈베로스 슈즈나이프
			{ 128710, 1 }, -- 루나파이터 기사 검
			{ 127950, 1 }, -- 시트 기사 검
			{ 108410, 1 }, -- 패패 기사 검
			--{ 108430, 1 }, -- 패패 기사 대검
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
    {
        CharType = 1, -- 리르
        ItemList =
        {
			{ 126070, 1 }, -- 켈베로스 활
			{ 126090, 1 }, -- 켈베로스 대궁
			{ 98550, 1 }, -- 켈베로스 마스크
			{ 98620, 1 }, -- 켈베로스 쉴드
			{ 98690, 1 }, -- 켈베로스 슈즈나이프
			{ 128720, 1 }, -- 루나파이터 궁수 활
			{ 127960, 1 }, -- 시트 궁수 활
			{ 108520, 1 }, -- 패패 궁수 활
			--{ 108540, 1 }, -- 패패 궁수 대궁
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
	{
        CharType = 2, -- 아르메
        ItemList =
        {
			{ 126110, 1 }, -- 켈베로스 지팡이
			{ 126130, 1 }, -- 켈베로스 램프
			{ 98560, 1 }, -- 켈베로스 마스크
			{ 98630, 1 }, -- 켈베로스 쉴드
			{ 98700, 1 }, -- 켈베로스 슈즈나이프
			{ 128730, 1 }, -- 루나파이터 마법사 지팡이
			{ 127970, 1 }, -- 시트 마법사 지팡이
			{ 108630, 1 }, -- 패패 마법사 지팡이
			--{ 108650, 1 }, -- 패패 마법사 램프
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
	{
        CharType = 3, -- 라스
        ItemList =
        {
			{ 98150, 3 }, -- 켈베로스 복장세트
			{ 126150, 1 }, -- 켈베로스 단검
			{ 126160, 1 }, -- 켈베로스 시미터
			{ 98500, 1 }, -- 켈베로스 윙(Lass)
			{ 98570, 1 }, -- 켈베로스 마스크
			{ 98640, 1 }, -- 켈베로스 쉴드
			{ 98710, 1 }, -- 켈베로스 슈즈나이프
			{ 102940, 3 }, -- 닌코 도적 복장세트
			{ 103170, 1 }, -- 닌코 도적 단검
			{ 128740, 1 }, -- 루나파이터 도적 단검
			{ 128850, 3 }, -- 루나파이터 도적 복장세트
			{ 127980, 1 }, -- 시트 도적 단검
			{ 128090, 3 }, -- 시트 도적 복장세트
			{ 108730, 3 }, -- 패패 도적 복장세트
			{ 108740, 1 }, -- 패패 도적 단검
			--{ 108750, 1 }, -- 패패 도적 시미터
			--{ 108760, 1 }, -- 패패 도적 클로
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
	{
        CharType = 4, -- 라이언
        ItemList =
        {
			{ 98220, 3 }, -- 켈베로스 복장세트
			{ 126190, 1 }, -- 켈베로스 도끼
			{ 126200, 1 }, -- 켈베로스 크리센트
			{ 98510, 1 }, -- 켈베로스 윙(Ryan)
			{ 98580, 1 }, -- 켈베로스 마스크
			{ 98650, 1 }, -- 켈베로스 쉴드
			{ 98720, 1 }, -- 켈베로스 슈즈나이프
			{ 103010, 3 }, -- 닌코 드루이드 복장세트
			{ 103180, 1 }, -- 닌코 드루이드 도끼
			{ 128750, 1 }, -- 루나파이터 드루이드 도끼
			{ 128920, 3 }, -- 루나파이터 드루이드 복장세트
			{ 127990, 1 }, -- 시트 드루이드 도끼
			{ 128160, 3 }, -- 시트 드루이드 복장세트
			{ 108840, 3 }, -- 패패 드루이드 복장세트
			{ 108850, 1 }, -- 패패 드루이드 도끼
			--{ 108860, 1 }, -- 패패 드루이드 크리센트
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
	{
        CharType = 5, -- 로난
        ItemList =
        {
			{ 98290, 3 }, -- 켈베로스 복장세트
			{ 126230, 1 }, -- 켈베로스 마검
			{ 126240, 1 }, -- 켈베로스 그레이브
			{ 126250, 1 }, -- 켈베로스 소드쉴드
			{ 98520, 1 }, -- 켈베로스 윙(Ronan)
			{ 98590, 1 }, -- 켈베로스 마스크
			{ 98660, 1 }, -- 켈베로스 쉴드
			{ 98730, 1 }, -- 켈베로스 슈즈나이프
			{ 103080, 3 }, -- 닌코 마검사 복장세트
			{ 103190, 1 }, -- 닌코 마검사 마검
			{ 128760, 1 }, -- 루나파이터 마검사 마검
			{ 128990, 3 }, -- 루나파이터 마검사 복장세트
			{ 128000, 1 }, -- 시트 마검사 마검
			{ 128230, 3 }, -- 시트 마검사 복장세트
			{ 108950, 3 }, -- 패패 마검사 복장세트
			{ 108960, 1 }, -- 패패 마검사 마검
			--{ 108970, 1 }, -- 패패 마검사 그레이브
			--{ 108980, 1 }, -- 패패 마검사 소드 쉴드
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
	{
        CharType = 6, -- 에이미
        ItemList =
        {
			{ 98360, 3 }, -- 켈베로스 복장세트
			{ 98530, 1 }, -- 켈베로스 윙(Amy)
			{ 126270, 1 }, -- 켈베로스 차크람
			{ 98600, 1 }, -- 켈베로스 마스크
			{ 98670, 1 }, -- 켈베로스 쉴드
			{ 98740, 1 }, -- 켈베로스 슈즈나이프
			{ 103150, 3 }, -- 닌코 무희 복장세트
			{ 103200, 1 }, -- 닌코 무희 차크람
			{ 128770, 1 }, -- 루나파이터 무희 차크람
			{ 129060, 3 }, -- 루나파이터 무희 복장세트
			{ 128010, 1 }, -- 시트 무희 차크람
			{ 128300, 3 }, -- 시트 무희 복장세트
			{ 109060, 3 }, -- 패패 무희 복장세트
			{ 109070, 1 }, -- 패패 무희 차크람
			{ 31730, 2 }, -- 크라운 스타(공용)
        }
    },
}
