BeginTime           = { 2008, 12, 1, 09 }   -- Y, M, D, H
EndTime             = { 2008, 12, 2, 09 }   -- Y, M, D, H
EventID             = 1
TickGap             = 1000 * 60         -- ms
MoneyItemID         = 8880
ItemList =
{
    -- Item ID, count, Factor, Price
    { 1, 175690, 1, 1, 1 },   -- 풍선껌 이모티콘1	귀엽게 풍선껌을 씹는 이모티콘입니다.
    { 2, 175700, 1, 1, 1 },   -- MP 풍선껌 (소비아이템)	MP 50% 회복시켜주는 풍선껌입니다.
    { 3, 175710, 1, 1, 1 },   -- HP 풍선껌 (소비아이템)	HP 50% 회복시켜주는 풍선껌입니다.
    { 4, 175720, 1, 1, 1 },   -- “Eu adoro  Buzzy Bol” signboard (사인보드)	Eu adoro Buzzy Bol 사인보드 입니다. EXP/GP가 20% 증가합니다.
    { 5, 175730, 1, 1, 1 },   -- Buzzy 봉인카드 (펫)	끈적끈적한 Buzzy펫과 함께 모험을 떠나보세요.
    { 6, 175740, 1, 1, 1 },   -- Buzzy stuck (펫스킬)	끈적한 몸통으로 들이밖아 행동을 못하게 만드는 Buzzy의 기본형 필살기입니다.
    { 7, 175750, 1, 1, 1 },   -- Buzzy stuck (펫스킬)	끈적한 몸통으로 들이밖아 행동을 못하게 만드는 Buzzy의 기본형 필살기입니다.
    { 8, 177190, 1, 1, 1 },   -- 강화보조 아이템 15%(풍선껌)	룬 강화 시에 이용되는 강화 보조 아이템입니다.
    { 9, 177200, 1, 1, 1 },   -- 강화보조 아이템 20%(풍선껌)	룬 강화 시에 이용되는 강화 보조 아이템입니다.
    { 10, 177210, 1, 1, 1 },   -- 풍선껌 쉴드 (스킬)	자신의 주변에 끈끈이 보호막을 치는 신 필살기입니다.
    { 11, 177220, 1, 1, 1 },   -- 풍선껌 끈끈이 화살 (스킬)	끈끈한 껌을 눈앞에 소환하여 상대방을 묶어버리는 신 필살기입니다.
    { 12, 177230, 1, 1, 1 },   -- 공격력 풍선껌 (소비아이템)	씹을 경우 공격력이 올라가는 특제 풍선껌
    { 13, 177240, 1, 1, 1 },   -- 방어력 풍선껌 (소비아이템)	씹을 경우 방어력력이 올라가는 특제 풍선껌
    { 14, 177250, 1, 1, 1 },   -- 슈퍼 점프 풍선껌 (소비아이템)	씹을 경우 공격력이 올라가는 특제 풍선껌
    { 15, 177260, 1, 1, 1 },   -- 풍선껌 이모티콘2	맛있게 풍선껌을 씹는 이모티콘입니다.
    { 16, 177270, 1, 1, 1 },   -- 풍선껌 이모티콘3	즐겁게 풍선껌을 씹는 이모티콘입니다.
    { 17, 177280, 1, 1, 1 },   -- 풍선껌 이모티콘4	신나게 풍선껌을 씹는 이모티콘입니다.
    { 18, 177290, 1, 1, 1 },   -- 풍선껌 이모티콘5	상큼하게 풍선껌을 씹는 이모티콘입니다.
}