TRUE = 1
FALSE = 0

PCBANG_PUBLISH = 1
PCBANG_KOG = 2
TH3BB_USER = 3

-- 남미용 PC방 혜택 타입
LIN_BENEFIT_TYPE1 = 4
LIN_BENEFIT_TYPE2 = 5
LIN_BENEFIT_TYPE3 = 6
LIN_BENEFIT_TYPE4 = 7
MaximumPCBangItemUID = 1000 -- PC방 지급아이템 ItemUID 시작값

msgID = "str_00"

ODBC_KeyString = 
{
    { '__odbcNMPCBang', 1 },    -- NetMarble PC 방
    { '__odbcGCPCBang', 2 },    -- GC PC 방
}

-- GP,EXP,SPX에 대하여 PC방 유저만 혜택을 받을건지/PC방 유저가 아닌 유저도 혜택을 받을건지 대해서 ON/OFF.
-- 해당 내용은 한방에 PC방 유저 수만큼 추가될 때의 Ratio에만 한정이다.
-- TRUE : PC방 이외의 유저들도 혜택을 받는다. FALSE : PC방 유저들만 혜택을 받는다.
-- 해당 내용은 PC방 유저에 한해서만 적용.
EnableUserPerPCRatio = FALSE 

Ratio = 
{
	{
		UserType = PCBANG_PUBLISH, -- 일반 pc방
		UserConfig = {
                        Lune        = 0.1,      -- 룬 강화--(정상배율 0.1)3월8일 한국 긴급 업데이트 PC방 살리기
                        Necklace    = 0.1,      -- 발찌 목걸이 강화--(정상배율 0.1)3월8일 한국 긴급 업데이트 PC방 살리기
                        DungeonDrop = 0.1,      -- 던전 드랍--(정상배율 0.1)3월8일 한국 긴급 업데이트 PC방 살리기
                        Exp         = 0.3,      -- 추가 Exp (정상배율 0.3)--3월8일 한국 긴급 업데이트 PC방 살리기
                        Gp          = 0.3,      -- 추가 Gp    (정상배율 0.3)--3월8일 한국 긴급 업데이트 PC방 살리기
                        Spx         = 0.0,      -- 추가 Spx
			PetExp      = 0.0,      -- 추가 Pet Exp
			PerUserExp  = 0.0,     -- 한방에 피씨방 유저 수만큼 추가
			PerUserGp   = 0.0,     -- 한방에 피씨방 유저 수만큼 추가
			PerUserSpx  = 0.0,     -- 한방에 피씨방 유저 수만큼 추가
		},
	},

}

DungeonClearReward =
{
    { Dungeon = { 9,10,11,12,13,14,15,16,17,18,}, Reward = { }, }, -- 베르메시아.
    { Dungeon = { 19,20,21,22,26,24,25,26,}, Reward = { }, }, -- 엘리아
    { Dungeon = { 27,30,36,42,47,48,49,50,}, Reward = { }, }, -- 제니아
    { Dungeon = { 39,40,41,43,44,45,46,}, Reward = { }, }, -- 실버랜드
    --[[{ Dungeon = { 9,}, Reward = { 352560, 1, -1,}, }, -- 세르딘성 외곽(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 10,}, Reward = { 352560, 1, -1,}, }, -- 캐리비치(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 11,}, Reward = { 352560, 1, -1,}, }, -- 오크사원(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 12,}, Reward = { 352560, 1, -1,}, }, -- 고르고스 던전(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 13,}, Reward = { 352560, 1, -1,}, }, -- 엘프의 숲(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 14,}, Reward = { 352560, 1, -1,}, }, -- 맹세의 계곡(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 15,}, Reward = { 352560, 1, -1,}, }, -- 망각의 늪(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 16,}, Reward = { 352560, 1, -1,}, }, -- 망자의 묘지(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 17,}, Reward = { 352560, 1, -1,}, }, -- 잊혀진 도시(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 18,}, Reward = { 352560, 1, -1,}, }, -- 가이코즈의 성(신 베르메시아 몬스터 카드 상자)
    { Dungeon = { 19,}, Reward = { 359330, 1, -1,}, }, -- 파투세이의 바다(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 20,}, Reward = { 359330, 1, -1,}, }, -- 카미키 성채(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 21,}, Reward = { 359330, 1, -1,}, }, -- 불의 사원(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 22,}, Reward = { 359330, 1, -1,}, }, -- 헬 브릿지(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 23,}, Reward = { 359330, 1, -1,}, }, -- 카제아제의 성(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 24,}, Reward = { 359330, 1, -1,}, }, -- 카스툴 유적지 하층(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 25,}, Reward = { 359330, 1, -1,}, }, -- 카스툴 유적지 상층(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 26,}, Reward = { 359330, 1, -1,}, }, -- 베르메시아의 최후(신 엘리아 몬스터 카드 상자)
    { Dungeon = { 27,}, Reward = { 359340, 1, -1,}, }, -- 제니아 접경지(신 제니아 몬스터 카드 상자)
    { Dungeon = { 30,}, Reward = { 359340, 1, -1,}, }, -- 순환의 신전(신 제니아 몬스터 카드 상자)
    { Dungeon = { 36,}, Reward = { 359340, 1, -1,}, }, -- 소실의 협곡(신 제니아 몬스터 카드 상자)
    { Dungeon = { 42,}, Reward = { 359340, 1, -1,}, }, -- 이그니스의 산맥(신 제니아 몬스터 카드 상자)
    { Dungeon = { 47,}, Reward = { 359340, 1, -1,}, }, -- 조율의 제단(신 제니아 몬스터 카드 상자)
    { Dungeon = { 48,}, Reward = { 359340, 1, -1,}, }, -- 파괴의 신전(신 제니아 몬스터 카드 상자)
    { Dungeon = { 49,}, Reward = { 359340, 1, -1,}, }, -- 생명의 숲(신 제니아 몬스터 카드 상자)
    { Dungeon = { 50,}, Reward = { 359340, 1, -1,}, }, -- 지배의 성(신 제니아 몬스터 카드 상자)
    { Dungeon = { 39,}, Reward = { 356450, 1, -1,}, }, -- 성난엔트의 숲(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 40,}, Reward = { 356450, 1, -1,}, }, -- 실버나이츠의 폐허(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 41,}, Reward = { 356450, 1, -1,}, }, -- 미명의 호수(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 43,}, Reward = { 356450, 1, -1,}, }, -- 수룡의 늪(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 44,}, Reward = { 356450, 1, -1,}, }, -- 원시의 섬(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 45,}, Reward = { 356450, 1, -1,}, }, -- 드레이크웜의 영지(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 46,}, Reward = { 356450, 1, -1,}, }, -- 빅터의 요새(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 55,}, Reward = { 356450, 1, -1,}, }, -- 고블린 노역소(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 56,}, Reward = { 356450, 1, -1,}, }, -- 지하암흑 터널(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 57,}, Reward = { 356450, 1, -1,}, }, -- 쿵지쿵지(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 59,}, Reward = { 356450, 1, -1,}, }, -- 신기루 사막(신 실버랜드 몬스터 카드 상자)
    { Dungeon = { 58,}, Reward = { 357560, 1, -1,}, }, -- 드워프 전초기지(아케메디아 몬스터 카드 상자)
    { Dungeon = { 60,}, Reward = { 357560, 1, -1,}, }, -- 드워프 보급로(아케메디아 몬스터 카드 상자)
    { Dungeon = { 61,}, Reward = { 357560, 1, -1,}, }, -- 썬더 해머(아케메디아 몬스터 카드 상자)
    ]]--
}

LevelUpReward = -- 캐릭터 구분 없음
{
    -- 시즌4 수정
    { Level = { 30,35,40,45,50, }, Reward = { 58700,1,-1, 82050,4,-1, } },

    --{ Level = { 1,2,3,4,5,6,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25, }, Reward = { 158980,1,-1, } },
    --{ Level = { 26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50, }, Reward = { 100950,1,-1, } },
    --{ Level = { 5,10,15,20,25, }, Reward = { 71780,1,-1, 82050,3,-1,} },
    --{ Level = { 30,35,40,45,50, }, Reward = { 58700,1,-1, 82050,4,-1, } },
    --{ Level = { 55,60,65,70,75, }, Reward = { 71770,1,-1, 82050,5,-1, } },
}

DailyConnectionReward = -- 하루 한번
{
    -- ItemID, Duration, Period, ..
    Item = { 17510, 10,-1,},
}

-- ItemUID의 시작값은 1000부터 시작한다.
ConnectionReward = -- 영구 아이템만 지급 가능... FakeItem = { ItemID, Duration, Period, ItemUID }
{
    {
        UserType = PCBANG_PUBLISH, -- 일반 pc방
        ItemInfo = {
        	-- Char 0 : 1000 ~ 1025까지 사용
        	{ Char = 0, LevelRange = { 0, 75 }, FakeItem = { 169550,-1,-1,1000,169560,-1,-1,1001,169570,-1,-1,1002,169580,-1,-1,1003,169590,-1,-1,1004,170180,-1,-1,1005,170190,-1,-1,1006,170200,-1,-1,1007,170210,-1,-1,1008,190680,-1,-1,1009,190690,-1,-1,1010,190700,-1,-1,1011,190710,-1,-1,1012,190720,-1,-1,1013,191220,-1,-1,1014,191230,-1,-1,1015,191240,-1,-1,1016,191250,-1,-1,1017,191530,-1,-1,1018,191540,-1,-1,1019,191550,-1,-1,1020,191560,-1,-1,1021,191570,-1,-1,1022,192070,-1,-1,1023,192080,-1,-1,1024,192090,-1,-1,1025, } },
        	-- Char 1 : 1026 ~ 1051까지 사용
        	{ Char = 1, LevelRange = { 0, 75 }, FakeItem = { 169610,-1,-1,1026,169620,-1,-1,1027,169630,-1,-1,1028,169640,-1,-1,1029,169650,-1,-1,1030,170220,-1,-1,1031,170230,-1,-1,1032,170240,-1,-1,1033,170250,-1,-1,1034,190740,-1,-1,1035,190750,-1,-1,1036,190760,-1,-1,1037,190770,-1,-1,1038,190780,-1,-1,1039,191260,-1,-1,1040,191270,-1,-1,1041,191280,-1,-1,1042,191290,-1,-1,1043,191590,-1,-1,1044,191600,-1,-1,1045,191610,-1,-1,1046,191620,-1,-1,1047,191630,-1,-1,1048,192100,-1,-1,1049,192110,-1,-1,1050,192120,-1,-1,1051, } },
        	-- Char 2 : 1052 ~ 1077까지 사용
        	{ Char = 2, LevelRange = { 0, 75 }, FakeItem = { 169670,-1,-1,1052,169680,-1,-1,1053,169690,-1,-1,1054,169700,-1,-1,1055,169710,-1,-1,1056,170260,-1,-1,1057,170270,-1,-1,1058,170280,-1,-1,1059,170290,-1,-1,1060,190800,-1,-1,1061,190810,-1,-1,1062,190820,-1,-1,1063,190830,-1,-1,1064,190840,-1,-1,1065,191300,-1,-1,1066,191310,-1,-1,1067,191320,-1,-1,1068,191330,-1,-1,1069,191650,-1,-1,1070,191660,-1,-1,1071,191670,-1,-1,1072,191680,-1,-1,1073,191690,-1,-1,1074,192130,-1,-1,1075,192140,-1,-1,1076,192150,-1,-1,1077, } },
        	-- Char 3 : 1078 ~ 1104까지 사용
        	{ Char = 3, LevelRange = { 0, 75 }, FakeItem = { 169730,-1,-1,1078,169740,-1,-1,1079,169750,-1,-1,1080,169760,-1,-1,1081,169770,-1,-1,1082,170300,-1,-1,1083,170310,-1,-1,1084,170320,-1,-1,1085,170330,-1,-1,1086,190860,-1,-1,1087,190870,-1,-1,1088,190880,-1,-1,1089,190890,-1,-1,1091,190900,-1,-1,1092,191340,-1,-1,1093,191350,-1,-1,1094,191360,-1,-1,1095,191370,-1,-1,1096,191710,-1,-1,1097,191720,-1,-1,1098,191730,-1,-1,1099,191740,-1,-1,1100,191750,-1,-1,1101,192160,-1,-1,1102,192170,-1,-1,1103,192180,-1,-1,1104, } },
        	-- Char 4 : 1105 ~ 1130까지 사용
        	{ Char = 4, LevelRange = { 0, 75 }, FakeItem = { 169790,-1,-1,1105,169800,-1,-1,1106,169810,-1,-1,1107,169820,-1,-1,1108,169830,-1,-1,1109,170340,-1,-1,1110,170350,-1,-1,1111,170360,-1,-1,1112,170370,-1,-1,1113,190920,-1,-1,1114,190930,-1,-1,1115,190940,-1,-1,1116,190950,-1,-1,1117,190960,-1,-1,1118,191380,-1,-1,1119,191390,-1,-1,1120,191400,-1,-1,1121,191410,-1,-1,1122,191770,-1,-1,1123,191780,-1,-1,1124,191790,-1,-1,1125,191800,-1,-1,1126,191810,-1,-1,1127,192190,-1,-1,1128,192200,-1,-1,1129,192210,-1,-1,1130, } },
        	-- Char 5 : 1131 ~ 1156까지 사용
        	{ Char = 5, LevelRange = { 0, 75 }, FakeItem = { 169850,-1,-1,1131,169860,-1,-1,1132,169870,-1,-1,1133,169880,-1,-1,1134,169890,-1,-1,1135,170380,-1,-1,1136,170390,-1,-1,1137,170400,-1,-1,1138,170410,-1,-1,1139,190980,-1,-1,1140,190990,-1,-1,1141,191000,-1,-1,1142,191010,-1,-1,1143,191020,-1,-1,1144,191420,-1,-1,1145,191430,-1,-1,1146,191440,-1,-1,1147,191450,-1,-1,1148,191830,-1,-1,1149,191840,-1,-1,1150,191850,-1,-1,1151,191860,-1,-1,1152,191870,-1,-1,1153,192220,-1,-1,1154,192230,-1,-1,1155,192240,-1,-1,1156, } },
        	-- Char 6 : 1157 ~ 1182까지 사용
        	{ Char = 6, LevelRange = { 0, 75 }, FakeItem = { 169910,-1,-1,1157,169920,-1,-1,1158,169930,-1,-1,1159,169940,-1,-1,1160,169950,-1,-1,1161,170420,-1,-1,1162,170430,-1,-1,1163,170440,-1,-1,1164,191040,-1,-1,1165,191050,-1,-1,1166,191060,-1,-1,1167,191070,-1,-1,1168,191080,-1,-1,1169,191460,-1,-1,1170,191470,-1,-1,1171,191480,-1,-1,1172,191890,-1,-1,1173,191900,-1,-1,1174,191910,-1,-1,1175,191920,-1,-1,1176,191930,-1,-1,1177,192250,-1,-1,1178,192260,-1,-1,1179,192270,-1,-1,1180,206790,-1,-1,1181,217860,-1,-1,1182, } },
        	-- Char 7 : 1183 ~ 1208까지 사용
        	{ Char = 7, LevelRange = { 0, 75 }, FakeItem = { 169970,-1,-1,1183,169980,-1,-1,1184,169990,-1,-1,1185,170000,-1,-1,1186,170010,-1,-1,1187,170450,-1,-1,1188,170460,-1,-1,1189,170470,-1,-1,1190,191100,-1,-1,1191,191110,-1,-1,1192,191120,-1,-1,1193,191130,-1,-1,1194,191140,-1,-1,1195,191490,-1,-1,1196,191500,-1,-1,1197,191510,-1,-1,1198,191950,-1,-1,1199,191960,-1,-1,1200,191970,-1,-1,1201,191980,-1,-1,1202,191990,-1,-1,1203,192280,-1,-1,1204,192290,-1,-1,1205,192300,-1,-1,1206,205740,-1,-1,1207,217870,-1,-1,1208, } },
        	-- Char 8 : 1209 ~ 1232까지 사용	
            { Char = 8, LevelRange = { 0, 75 }, FakeItem = { 170030,-1,-1,1209,170040,-1,-1,1210,170050,-1,-1,1211,170060,-1,-1,1212,170070,-1,-1,1213,170480,-1,-1,1214,191160,-1,-1,1215,191170,-1,-1,1216,191180,-1,-1,1217,191190,-1,-1,1218,191200,-1,-1,1219,191520,-1,-1,1220,192010,-1,-1,1221,192020,-1,-1,1222,192030,-1,-1,1223,192040,-1,-1,1224,192050,-1,-1,1225,192310,-1,-1,1226,217900,-1,-1,1227,217880,-1,-1,1228,205750,-1,-1,1229, 205760,-1,-1,1230, 217890,-1,-1,1231, 217910,-1,-1,1232,     } },
            -- Char 9 : 1233 ~ 1256 까지 사용 (예약)
            -- Char 10 : 1257 ~ 1280 까지 사용 (예약)
            -- Char 11 : 1281 ~ 1304 까지 사용 (예약)
            -- Char 12 : 1305 ~ 1328 까지 사용
            { Char = 12, LevelRange = { 0, 80 }, FakeItem = { 526000,-1,-1,1305,526010,-1,-1,1306,526020,-1,-1,1307,526030,-1,-1,1308,526040,-1,-1,1309,526050,-1,-1,1310, } },
			-- Char 13 : 1329 ~ 1352 까지 사용 (예약)
			-- Char 14 : 1353 ~ 1376 까지 사용 (예약)
			-- Char 15 : 1377 ~ 1400 까지 사용 (예약)
        },
    },
}

-- Pet Item의 경우 현재 ItemUID는 1400 부터 생성.
PetConnectionReward = 
{
    {
        UserType = PCBANG_PUBLISH,
        PetInfo = {
            {
                PetItemID = 218800,
				PetItemUID = 1400,
                PetStrName = "str_10",
                PetEquipItem = { 218810, 127, 1401 }, -- { ItemID, Factor, ItemUID, } 장착아이템( 스킬 정보. )
            },
        },
    },
}

-- 펫 코스튬의 경우 영구만 지급 가능하다.
PetCostumeItem = 
{
    Item = { },
}

-- 사내테섭 테스트용 IP등록
TestIP =
{
    { "14.45.79.129", "14.45.79.254" }, -- KOG
	{ "192.168.130.1", "192.168.130.255" }, -- KOG
	{ "211.234.69.129", "211.234.69.254" }, -- KOG
}

-- 남미 사내테섭 테스트용 ID와 PC방 혜택 강제 연결
USE_LIN_BENEFIT_TEST = TRUE
LINBenefitTestID =
{
--[[
ID: GCcyber1 ~ GCcyber10, testergc01
Pass: tester123 -- 패스워드는 md5계산을 해야 테스트 페이지에서 사용할 수 있다
md5(tester123) = 8e607a4752fa2e59413e5790536f2b42

경험치 보너스
10% IP 200.1.1.1
15% IP 200.2.2.2
20% IP 190.3.3.3
25% IP 192.4.4.4

테섭용: http://auth.tst.axeso5.com/webservice/axeso5WSv3.asmx
본섭용: http://auth.axeso5.com/webservice/axeso5WSv3.asmx
--]]
    { "gccyber1", LIN_BENEFIT_TYPE1 },
    { "gccyber2", LIN_BENEFIT_TYPE2 },
    { "gccyber3", LIN_BENEFIT_TYPE3 },
    { "gccyber4", LIN_BENEFIT_TYPE4 },
}
