-- 점핑 캐릭터 이벤트
-- 이벤트 기간 설정.
BeginTime       = { 2013, 08, 12, 00 }   -- Y, M, D, H
EndTime         = { 2013, 09, 12, 08 }   -- Y, M, D, H

-- 점핑 캐릭터 이벤트 사용시 캐릭터 레벨 & 전직정보
JumpingCharLevel = 70
JumpingCharPromotion = 3

-- 점핑 가능한 캐릭터 리스트
JumpingEnableCharList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17 }

-- 점핑 캐릭터 사용시 열어줘야 하는 던전정보.
CharClearDungeonInfo =
{
	{ Char = 0, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 1, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 2, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 3, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 4, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 5, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 6, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 7, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 8, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 9, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 10, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 11, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 12, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 13, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 14, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 15, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
	{ Char = 16, DungeonClearList = { 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34} }, --아툼 진입 가능 상태
}

-- 점핑 캐릭터 사용시 지급해야 하는 보상 아이템
CharRewardItemInfo =
{
	-- [Char, DefaultItem = { ItemID, Count, Period, ItemID, Count, Period } ]
	{ Char = 0, DefaultItem = { 597460	, -1, -1,	1248150	, 1, -1,	433600	, -1, -1,	438000	, -1, -1,	438010	, -1, -1,	438020	, -1, -1,	438030	, -1, -1, } },
	{ Char = 1, DefaultItem = { 597460	, -1, -1,	1248160	, 1, -2,	433670	, -1, -1,	438040	, -1, -1,	438050	, -1, -1,	438060	, -1, -1,	438070	, -1, -1, } },
	{ Char = 2, DefaultItem = { 597460	, -1, -1,	1248170	, 1, -3,	433740	, -1, -1,	438080	, -1, -1,	438090	, -1, -1,	438100	, -1, -1,	438110	, -1, -1, } },
	{ Char = 3, DefaultItem = { 597460	, -1, -1,	1248180	, 1, -4,	433810	, -1, -1,	438120	, -1, -1,	438130	, -1, -1,	438140	, -1, -1,	438150	, -1, -1, } },
	{ Char = 4, DefaultItem = { 597460	, -1, -1,	1248190	, 1, -5,	433880	, -1, -1,	438160	, -1, -1,	438170	, -1, -1,	438180	, -1, -1,	438190	, -1, -1, } },
	{ Char = 5, DefaultItem = { 597460	, -1, -1,	1248200	, 1, -6,	433950	, -1, -1,	438200	, -1, -1,	438210	, -1, -1,	438220	, -1, -1,	438230	, -1, -1, } },
	{ Char = 6, DefaultItem = { 597460	, -1, -1,	1248210	, 1, -7,	434020	, -1, -1,	438240	, -1, -1,	438250	, -1, -1,	438260	, -1, -1,	438270	, -1, -1, } },
	{ Char = 7, DefaultItem = { 597460	, -1, -1,	1248220	, 1, -8,	434090	, -1, -1,	438280	, -1, -1,	438290	, -1, -1,	438300	, -1, -1,	438310	, -1, -1, } },
	{ Char = 8, DefaultItem = { 597460	, -1, -1,	1248230	, 1, -9,	434160	, -1, -1,	438320	, -1, -1,	438330	, -1, -1,	438340	, -1, -1,	438350	, -1, -1, } },
	{ Char = 9, DefaultItem = { 597460	, -1, -1,	1248240	, 1, -10,	434230	, -1, -1,	438360	, -1, -1,	438370	, -1, -1,	438380	, -1, -1,	629660	, -1, -1, } },
	{ Char = 10, DefaultItem = { 597460	, -1, -1,	1248250	, 1, -11,	434300	, -1, -1,	438390	, -1, -1, } },
	{ Char = 11, DefaultItem = { 597460	, -1, -1,	1248260	, 1, -12,	456470	, -1, -1,	456540	, -1, -1, } },
	{ Char = 12, DefaultItem = { 597460	, -1, -1,	1248270	, 1, -13,	522270	, -1, -1,	523200	, -1, -1, } },
	{ Char = 13, DefaultItem = { 597460	, -1, -1,	1248280	, 1, -14,	694270	, -1, -1,	697020	, -1, -1, } },
	{ Char = 14, DefaultItem = { 597460	, -1, -1,	1248290	, 1, -15,	708660	, -1, -1,	711410	, -1, -1, } },
	{ Char = 15, DefaultItem = { 597460	, -1, -1,	1248300	, 1, -16,	863340	, -1, -1,	866030	, -1, -1, } },
	{ Char = 16, DefaultItem = { 597460	, -1, -1,	1248310	, 1, -17,	932990	, -1, -1,	938320	, -1, -1, } },
}

-- 점핑 캐릭터 사용시 기본적으로 지급되어야 하는 스킬정보
CharRewardSkillInfo = 
{
	-- [Char, RewardSkillList = { SkillID.., } ]
	{	Char	=	0,	RewardSkillList	=	{	1024,	1025,	1027,	1029,	1031,	}	},	--4단필,	엠피4칸
    {	Char	=	1,	RewardSkillList	=	{	1032,	1033,	1035,	1037,	1039,	}	},	--4단필,	엠피4칸
    {	Char	=	2,	RewardSkillList	=	{	1040,	1041,	1043,	1045,	1047,	}	},	--4단필,	엠피4칸
    {	Char	=	3,	RewardSkillList	=	{	1048,	1049,	1051,	1053,	1055,	}	},	--4단필,	엠피4칸
    {	Char	=	4,	RewardSkillList	=	{	1056,	1057,	1059,	1061,	1063,	}	},	--4단필,	엠피4칸
    {	Char	=	5,	RewardSkillList	=	{	1064,	1065,	1067,	1069,	1071,	}	},	--4단필,	엠피4칸
    {	Char	=	6,	RewardSkillList	=	{	1072,	1073,	1075,	1077,	1079,	}	},	--4단필,	엠피4칸
    {	Char	=	7,	RewardSkillList	=	{	1080,	1081,	1083,	1085,	1087,	}	},	--4단필,	엠피4칸
    {	Char	=	8,	RewardSkillList	=	{	1088,	1089,	1091,	1093,	1095,	}	},	--4단필,	엠피4칸
    {	Char	=	9,	RewardSkillList	=	{	1096,	1097,	1099,	1101,	1103,	}	},	--4단필,	엠피4칸
    {	Char	=	10,	RewardSkillList	=	{	1104,	1105,	}	},	--4단필,	엠피4칸
    {	Char	=	11,	RewardSkillList	=	{	1108,	1109,	}	},	--4단필,	엠피4칸
    {	Char	=	12,	RewardSkillList	=	{	1106,	1107,	}	},	--4단필,	엠피4칸
    {	Char	=	13,	RewardSkillList	=	{	1244,	1245,	}	},	--4단필,	엠피4칸
    {	Char	=	14,	RewardSkillList	=	{	1110,	1111,	}	},	--4단필,	엠피4칸
    {	Char	=	15,	RewardSkillList	=	{	1244,	1245,	}	},	--4단필,	엠피4칸
    {	Char	=	16,	RewardSkillList	=	{	1244,	1245,	}	},	--4단필,	엠피4칸

}

-- 점핑 캐릭터 사용시 기본적으로 지급되어야 하는 캐시 스킬 그룹 ID 정보
CharRewardUnlockSkillGroup = 
{
	-- [Char, UnlockGroupList = { GroupID.., } ]
	{ Char = 0, UnlockGroupList = { 0, 1, 2, } },
	{ Char = 1, UnlockGroupList = { 3, 4, 5, 6, 7, 8, } },
	{ Char = 2, UnlockGroupList = { 9, 10, 11, } },
	{ Char = 3, UnlockGroupList = { 12, 13, 14, } },
	{ Char = 4, UnlockGroupList = { 15, 16, 17, } },
	{ Char = 5, UnlockGroupList = { 18, 19, 20, 21, 22, 23, } },
	{ Char = 6, UnlockGroupList = { 24, 25, 26, 27, 28, 29 } },
	{ Char = 7, UnlockGroupList = { 33, 34, 35, } },
	{ Char = 8, UnlockGroupList = { 30, 31, 32, } },
}

-- 점핑 캐릭터 사용시 완료처리되어야 하는 미션 리스트.
CharClearMissionInfo = 
{
	-- [Char, ClearMissionList = { MissionID.., } ]
	{ Char = 13, ClearMissionList = { 986800, 986950, 987400, 987850, 1194770, 1195260, } }, --4단필 및 엠피4칸 미션
}

-- 점핑 캐릭터 이벤트 진행하지 않을 경우 지급받을 보상 아이템 정보
-- DefaultRewardItem = { ItemID, Count, Period }
DefaultRewardItem = { 362080, 100, -1, 1024420, 50, -1, 1024430, 50, -1, 10244240, 50, -1 } --영웅주화와 데몬코어 3종