Version = 5

BeginTime = { 2013, 01, 30, 08 }   -- 이벤트 시작(Y, M, D, H)
EndTime = { 2013, 04, 30, 08 }     -- 이벤트 종료(Y, M, D, H)

EscortInfo =    -- 호위 이벤트 몬스터 등장 정보
{
    {
        7, 0, 0, 5,    -- { DungeonID, Difficulty(0~3, 255), MinLevel, MaxLevel }
        AppearChances = {
            { 416, 100, }, -- { 출현 몬스터 ID, 등장 확률 }
        },
    },
    {
        8, 0, 0, 7,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        9, 0, 1, 9,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        9, 255, 4, 12,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        10, 0, 3, 11,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        10, 255, 6, 14,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        11, 0, 5, 13,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        11, 255, 8, 16,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        12, 0, 7, 15,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        12, 255, 10, 18,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        13, 0, 9, 17,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        13, 255, 12, 20,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        14, 0, 11, 19,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        14, 255, 14, 22,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        15, 0, 13, 21,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        15, 255, 16, 24,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        16, 0, 15, 23,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        16, 255, 18, 26,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        17, 0, 17, 25,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        17, 255, 20, 28,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        18, 0, 19, 27,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        18, 255, 22, 30,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        19, 0, 35, 43,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        19, 1, 36, 44,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        19, 2, 37, 45,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        19, 255, 38, 46,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        20, 0, 37, 45,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        20, 1, 38, 46,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        20, 2, 39, 47,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        20, 255, 40, 48,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        21, 0, 39, 47,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        21, 1, 40, 48,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        21, 2, 41, 49,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        21, 255, 42, 50,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        22, 0, 41, 49,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        22, 1, 42, 50,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        22, 2, 43, 51,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        22, 255, 44, 52,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        23, 0, 43, 51,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        23, 1, 44, 52,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        23, 2, 45, 53,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        23, 255, 46, 54,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        24, 0, 45, 53,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        24, 1, 46, 54,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        24, 2, 47, 55,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        24, 255, 48, 56,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        25, 0, 47, 55,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        25, 1, 48, 56,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        25, 2, 49, 57,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        25, 255, 50, 58,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        26, 0, 49, 57,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        26, 1, 50, 58,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        26, 2, 51, 59,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        26, 255, 52, 60,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        27, 0, 51, 59,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        27, 1, 52, 60,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        27, 2, 53, 61,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        27, 255, 54, 62,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        30, 0, 53, 61,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        30, 1, 54, 62,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        30, 2, 55, 63,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        30, 255, 56, 64,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        36, 0, 55, 63,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        36, 1, 56, 64,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        36, 2, 57, 65,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        36, 255, 58, 66,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        39, 0, 21, 29,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        39, 1, 22, 30,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        39, 255, 26, 32,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        40, 0, 23, 31,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        40, 1, 24, 32,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        40, 255, 26, 34,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        41, 0, 25, 33,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        41, 1, 26, 34,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        41, 255, 28, 36,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        42, 0, 57, 65,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        42, 1, 58, 66,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        42, 2, 59, 67,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        42, 255, 60, 68,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        43, 0, 27, 35,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        43, 1, 28, 36,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        43, 255, 30, 38,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        44, 0, 29, 37,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        44, 1, 30, 38,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        44, 255, 32, 40,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        45, 0, 31, 39,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        45, 1, 32, 40,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        45, 255, 34, 42,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        46, 0, 33, 41,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        46, 1, 34, 42,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        46, 255, 36, 44,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        47, 0, 59, 67,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        47, 1, 60, 68,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        47, 2, 61, 69,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        47, 255, 62, 70,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        48, 0, 61, 69,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        48, 1, 62, 70,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        48, 2, 63, 71,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        48, 255, 64, 72,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        49, 0, 63, 71,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        49, 1, 64, 72,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        49, 2, 65, 73,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        49, 255, 66, 74,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        50, 0, 65, 73,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        50, 1, 66, 74,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        50, 2, 67, 75,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        50, 255, 68, 76,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        55, 0, 67, 75,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        55, 1, 68, 76,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        55, 2, 69, 77,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        55, 255, 70, 78,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        56, 0, 69, 77,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        56, 1, 70, 78,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        56, 2, 71, 79,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        56, 255, 72, 80,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        57, 0, 71, 79,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        57, 1, 72, 80,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        57, 2, 73, 81,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        57, 255, 74, 82,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        58, 0, 67, 75,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        58, 1, 68, 76,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        58, 2, 69, 77,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        58, 255, 70, 78,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        59, 0, 73, 81,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        59, 1, 74, 82,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        59, 2, 74, 83,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        59, 255, 74, 84,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        60, 0, 69, 77,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        60, 1, 70, 78,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        60, 2, 71, 79,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        60, 255, 72, 80,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        61, 0, 71, 79,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        61, 1, 72, 80,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        61, 2, 73, 81,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        61, 255, 74, 82,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        64, 0, 73, 81,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        64, 1, 74, 82,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        64, 2, 74, 83,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        64, 255, 74, 84,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        67, 0, 17, 42,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        67, 1, 37, 62,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
    {
        67, 2, 57, 79,
        AppearChances = {
            { 416, 25, },
            { 421, 30, },
        },
    },
}

EscortMonsterInfo =   -- 몬스터 정보
{
    {
        MonsterID = 416,            -- 몬스터 ID
        MonsterHealth = 10000,        -- 몬스터 체력    
        TakeDamage = 1,            -- 받는 데미지
        InvincibleTime = 30,      -- 무적시간(ms)
        PotionID = 73632,           -- 회복 아이템 ID( ID 끝에 0 빼고 넣어주세요 )
        AnnounceStrings = { },   -- 안내 문구 스트링 번호
    },
    {
        MonsterID = 421,            -- 몬스터 ID
        MonsterHealth = 10000,        -- 몬스터 체력    
        TakeDamage = 1,            -- 받는 데미지
        InvincibleTime = 30,      -- 무적시간(ms)
        PotionID = 73632,           -- 회복 아이템 ID( ID 끝에 0 빼고 넣어주세요 )
        AnnounceStrings = { },   -- 안내 문구 스트링 번호
    },
}

EscortRewardInfo =   -- 호위 보상 정보
{
    {
        MonsterID = 416,
        AliveReward =               -- 호위 몬스터가 살아있는 경우 보상
        {
            ExtraExp = 0,         -- 경험치 추가 보너스(%)
            ExtraGp = 0,          -- GP 추가 보너스(%)
            ClearRewardList =       -- 기본으로 지급할 아이템 목록
			{   -- ItemID, 수량, 기간, 지급확률
                { }, -- 한 묶음을 100% 기준으로 드랍율 설정
  			},
            ExtraRewardList =       -- 추가로 지급할 아이템 목록
            {
                {  },
            },
        },
        DeadReward =                -- 호위 몬스터가 죽었을 경우 보상
        {
            ExtraExp = 0,
            ExtraGp = 0,
            ClearRewardList =       -- 기본으로 지급할 아이템 목록
			{   -- ItemID, 수량, 기간, 지급확률
                { }, -- 한 묶음을 100% 기준으로 드랍율 설정
  			},
            ExtraRewardList =       -- 추가로 지급할 아이템 목록
            {

            },
        },
    },
    {
        MonsterID = 421,
        AliveReward =               -- 호위 몬스터가 살아있는 경우 보상
        {
            ExtraExp = 0,         -- 경험치 추가 보너스(%)
            ExtraGp = 0,          -- GP 추가 보너스(%)
            ClearRewardList =       -- 기본으로 지급할 아이템 목록
			{   -- ItemID, 수량, 기간, 지급확률
                { }, -- 한 묶음을 100% 기준으로 드랍율 설정
  			},
            ExtraRewardList =       -- 추가로 지급할 아이템 목록
            {
                {  },
            },
        },
        DeadReward =                -- 호위 몬스터가 죽었을 경우 보상
        {
            ExtraExp = 0,
            ExtraGp = 0,
            ClearRewardList =       -- 기본으로 지급할 아이템 목록
			{   -- ItemID, 수량, 기간, 지급확률
                { }, -- 한 묶음을 100% 기준으로 드랍율 설정
  			},
            ExtraRewardList =       -- 추가로 지급할 아이템 목록
            {

            },
        },
    },
}
