BeginTime       = { 2010, 9, 14, 20 }   -- Y, M, D, H
EndTime         = { 2010, 9, 30, 11 }   -- Y, M, D, H
TickGap         = 1000 * 60 -- ms
DropInterval    = 60 -- 드랍 주기(분)
DailyMaxDrop    = 24 -- 하루 최대 드랍 수

--[[
DR_ALL     = 0,
DR_PC_BANG = 1,
DR_NORMAL  = 2,
]]--

DropItem = {
    -- DropInterval 단위로 최대 DailyMaxDrop 만큼 드랍한다.
    -- Count = n회차, Item = { 받을 아이템 리스트{ItemID,수량,기간}, }
    --[[{   Count = 1,  Item = { {1,374700,1,-1,}, },   },
    {   Count = 2,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 3,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 4,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 5,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 6,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 7,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 9,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 10,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 11,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 12,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 13,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 14,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 15,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 16,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 17,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 18,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 19,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 20,  Item = { {1,374700,1,-1,}, },   },
    {   Count = 21,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 22,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 23,  Item = { {1,374700,1,-1,}, },   },
	{   Count = 24,  Item = { {1,374700,1,-1,}, },   },
	]]--
}

