-- MonsterRewardInfo.lua
MonLevelReward = {
	-- Level, Reward{ Exp,SP, GP }
	{ Level = 0, Reward = {1,1,1}, },
	{ Level = 1, Reward = {10,10,50}, },
	{ Level = 2, Reward = {11,11,52}, },
	{ Level = 3, Reward = {12,12,54}, },
	{ Level = 4, Reward = {13,13,56}, },
	{ Level = 5, Reward = {15,15,58}, },
	{ Level = 6, Reward = {16,16,60}, },
	{ Level = 7, Reward = {18,18,63}, },
	{ Level = 8, Reward = {19,19,66}, },
	{ Level = 9, Reward = {21,21,69}, },
	{ Level = 10, Reward = {24,24,72}, },
	{ Level = 11, Reward = {26,26,75}, },
	{ Level = 12, Reward = {29,29,78}, },
	{ Level = 13, Reward = {31,31,81}, },
	{ Level = 14, Reward = {35,35,85}, },
	{ Level = 15, Reward = {38,38,89}, },
	{ Level = 16, Reward = {42,42,93}, },
	{ Level = 17, Reward = {46,46,97}, },
	{ Level = 18, Reward = {51,51,101}, },
	{ Level = 19, Reward = {56,56,106}, },
	{ Level = 20, Reward = {61,61,111}, },
	{ Level = 21, Reward = {67,67,116}, },
	{ Level = 22, Reward = {74,74,121}, },
	{ Level = 23, Reward = {81,81,127}, },
	{ Level = 24, Reward = {90,90,133}, },
	{ Level = 25, Reward = {98,98,139}, },
	{ Level = 26, Reward = {108,108,145}, },
	{ Level = 27, Reward = {119,119,152}, },
	{ Level = 28, Reward = {131,131,159}, },
	{ Level = 29, Reward = {144,144,166}, },
	{ Level = 30, Reward = {159,159,174}, },
	{ Level = 31, Reward = {174,174,182}, },
	{ Level = 32, Reward = {192,192,191}, },
	{ Level = 33, Reward = {211,211,200}, },
	{ Level = 34, Reward = {232,232,210}, },
	{ Level = 35, Reward = {255,255,220}, },
	{ Level = 36, Reward = {281,281,231}, },
	{ Level = 37, Reward = {309,309,242}, },
	{ Level = 38, Reward = {340,340,254}, },
	{ Level = 39, Reward = {374,374,266}, },
	{ Level = 40, Reward = {411,411,279}, },
	{ Level = 41, Reward = {453,453,292}, },
	{ Level = 42, Reward = {498,498,306}, },
	{ Level = 43, Reward = {548,548,321}, },
	{ Level = 44, Reward = {602,602,337}, },
	{ Level = 45, Reward = {663,663,353}, },
	{ Level = 46, Reward = {729,729,370}, },
	{ Level = 47, Reward = {802,802,388}, },
	{ Level = 48, Reward = {882,882,407}, },
	{ Level = 49, Reward = {970,970,427}, },
	{ Level = 50, Reward = {1067,1067,448}, },
	{ Level = 51, Reward = {1174,1174,470}, },
	{ Level = 52, Reward = {1291,1291,493}, },
	{ Level = 53, Reward = {1420,1420,517}, },
	{ Level = 54, Reward = {1562,1562,542}, },
	{ Level = 55, Reward = {1719,1719,569}, },
	{ Level = 56, Reward = {1891,1891,597}, },
	{ Level = 57, Reward = {2080,2080,626}, },
	{ Level = 58, Reward = {2288,2288,657}, },
	{ Level = 59, Reward = {2516,2516,689}, },
	{ Level = 60, Reward = {2768,2768,723}, },
	{ Level = 61, Reward = {3045,3045,759}, },
	{ Level = 62, Reward = {3349,3349,796}, },
	{ Level = 63, Reward = {3684,3684,835}, },
	{ Level = 64, Reward = {4053,4053,876}, },
	{ Level = 65, Reward = {4458,4458,919}, },
	{ Level = 66, Reward = {4904,4904,964}, },
	{ Level = 67, Reward = {5394,5394,1012}, },
	{ Level = 68, Reward = {5933,5933,1062}, },
	{ Level = 69, Reward = {6527,6527,1115}, },
	{ Level = 70, Reward = {7180,7180,1170}, },
	{ Level = 71, Reward = {7897,7897,1228}, },
	{ Level = 72, Reward = {8687,8687,1289}, },
	{ Level = 73, Reward = {9556,9556,1353}, },
	{ Level = 74, Reward = {10512,10512,1420}, },
	{ Level = 75, Reward = {11563,11563,1491}, },
	{ Level = 76, Reward = {12719,12719,1565}, },
	{ Level = 77, Reward = {13991,13991,1643}, },
	{ Level = 78, Reward = {15390,15390,1725}, },
	{ Level = 79, Reward = {16929,16929,1811}, },
	{ Level = 80, Reward = {18622,18622,1901}, },
	{ Level = 81, Reward = {20484,20484,1996}, },
	{ Level = 82, Reward = {22532,22532,2095}, },
	{ Level = 83, Reward = {24786,24786,2199}, },
	{ Level = 84, Reward = {27264,27264,2308}, },
	{ Level = 85, Reward = {29991,29991,2423}, },
	{ Level = 86, Reward = {32990,32990,2544}, },
	{ Level = 87, Reward = {36289,36289,2671}, },
	{ Level = 88, Reward = {39918,39918,2804}, },
	{ Level = 89, Reward = {43909,43909,2944}, },
	{ Level = 90, Reward = {48300,48300,3091}, },
	{ Level = 91, Reward = {53130,53130,3245}, },
	{ Level = 92, Reward = {58443,58443,3407}, },
	{ Level = 93, Reward = {64288,64288,3577}, },
	{ Level = 94, Reward = {70716,70716,3755}, },
	{ Level = 95, Reward = {77788,77788,3942}, },
	{ Level = 96, Reward = {85567,85567,4139}, },
	{ Level = 97, Reward = {94123,94123,4345}, },
	{ Level = 98, Reward = {103536,103536,4562}, },
	{ Level = 99, Reward = {113889,113889,4790}, },
}

MonAddRatio = {	
	-- MonID, Ratio = { ExpRatio, SPRatio, GPRatio }
	{ ID = 0, Ratio = { 1, 1, 1}, }, -- 슬라임
	{ ID = 1, Ratio = { 1, 1, 1}, }, -- 머쉬룸
	{ ID = 3, Ratio = { 3, 3, 3}, }, -- 엔트
	{ ID = 4, Ratio = { 1, 1, 1}, }, -- 고블린
	{ ID = 5, Ratio = { 1, 1, 1}, }, -- 고블린투척병
	{ ID = 6, Ratio = { 1, 1, 1}, }, -- 오크
	{ ID = 7, Ratio = { 3, 3, 3}, }, -- 웬디
	{ ID = 10, Ratio = { 3, 3, 3}, }, -- 레드고르고스
	{ ID = 13, Ratio = { 1, 1, 1}, }, -- 아머랍스터
	{ ID = 14, Ratio = { 1, 1, 1}, }, -- 귀신아귀
	{ ID = 15, Ratio = { 1.1, 1.1, 1.1}, }, -- 해골 기사
	{ ID = 16, Ratio = { 1, 1, 1}, }, -- 해골 궁수
	{ ID = 17, Ratio = { 1.1, 1.1, 1.1}, }, -- 해골 기사대장
	{ ID = 18, Ratio = { 1, 1, 1}, }, -- 해골 궁수대장
	{ ID = 19, Ratio = { 1, 1, 1}, }, -- 아머캣
	{ ID = 20, Ratio = { 1, 1, 1}, }, -- 엘레나
	{ ID = 21, Ratio = { 3, 3, 3}, }, -- 카미키
	{ ID = 22, Ratio = { 3, 3, 3}, }, -- 가이코즈
	{ ID = 23, Ratio = { 2, 2, 2}, }, -- 카제아제 (라스)
	{ ID = 24, Ratio = { 3, 3, 3}, }, -- 카제아제 (원형)
	{ ID = 25, Ratio = { 3, 3, 3}, }, -- 사이클롭스
	{ ID = 26, Ratio = { 3, 3, 3}, }, -- 오크전사대장
	{ ID = 28, Ratio = { 1, 1, 1}, }, -- 하피
	{ ID = 29, Ratio = { 3, 3, 3}, }, -- 하피퀸
	{ ID = 30, Ratio = { 1, 1, 1}, }, -- 오크전사
	{ ID = 31, Ratio = { 1, 1, 1}, }, -- 오크투척병
	{ ID = 32, Ratio = { 3, 3, 3}, }, -- 오크로드
	{ ID = 33, Ratio = { 0.9, 0.9, 0.9}, }, -- 곤
	{ ID = 34, Ratio = { 1.1, 1.1, 1.1}, }, -- 고르곤
	{ ID = 35, Ratio = { 3, 3, 3}, }, -- 트롤
	{ ID = 36, Ratio = { 1, 1, 1}, }, -- 드릴몬
	{ ID = 37, Ratio = { 3, 3, 3}, }, -- 자이언트 드릴몬
	{ ID = 38, Ratio = { 3, 3, 3}, }, -- 엘리자베스
	{ ID = 39, Ratio = { 0.75, 0.75, 0.75}, }, -- 펌프킨헤드
	{ ID = 40, Ratio = { 1, 1, 1}, }, -- 해골
	{ ID = 41, Ratio = { 3, 3, 3}, }, -- 리치
	{ ID = 42, Ratio = { 1, 1, 1}, }, -- 파라미니미
	{ ID = 43, Ratio = { 3, 3, 3}, }, -- 파라돔
	{ ID = 44, Ratio = { 1, 1, 1}, }, -- 미니스톤골렘
	{ ID = 45, Ratio = { 1.2, 1.2, 1.2}, }, -- 미니 아이스골렘
	{ ID = 46, Ratio = { 1.1, 1.1, 1.1}, }, -- 미니 파이어골렘
	{ ID = 47, Ratio = { 1, 1, 1}, }, -- 강화된 앤몬정찰병
	{ ID = 48, Ratio = { 0.9, 0.9, 0.9}, }, -- 어둠의 앤몬정찰병
	{ ID = 50, Ratio = { 1, 1, 1}, }, -- 어둠의 앤몬문지기
	{ ID = 51, Ratio = { 3, 3, 3}, }, -- 바실리스크
	{ ID = 52, Ratio = { 3, 3, 3}, }, -- 가도센
	{ ID = 53, Ratio = { 3, 3, 3}, }, -- 자이언트 스톤골렘
	{ ID = 55, Ratio = { 1.1, 1.1, 1.1}, }, -- 좀비오크전사
	{ ID = 56, Ratio = { 1.5, 1.5, 1.5}, }, -- 스톤트롤
	{ ID = 57, Ratio = { 1.1, 1.1, 1.1}, }, -- 어둠의 다크메이지
	{ ID = 58, Ratio = { 1.1, 1.1, 1.1}, }, -- 어둠의 몽반
	{ ID = 59, Ratio = { 1.2, 1.2, 1.2}, }, -- 몽반 리더
	{ ID = 60, Ratio = { 2, 2, 2}, }, -- 리치
	{ ID = 61, Ratio = { 2, 2, 2}, }, -- 파이어 골렘
	{ ID = 62, Ratio = { 2, 2, 2}, }, -- 파라돔
	{ ID = 63, Ratio = { 1, 1, 1}, }, -- 광폭한 고블린
	{ ID = 64, Ratio = { 0.9, 0.9, 0.9}, }, -- 광폭한 고블린투척병
	{ ID = 65, Ratio = { 1, 1, 1}, }, -- 광폭한 오크
	{ ID = 66, Ratio = { 1.1, 1.1, 1.1}, }, -- 광폭한 오크전사
	{ ID = 67, Ratio = { 1, 1, 1}, }, -- 광폭한 하피
	{ ID = 68, Ratio = { 1.1, 1.1, 1.1}, }, -- 광폭한 드릴몬
	{ ID = 69, Ratio = { 0.9, 0.9, 0.9}, }, -- 광폭한 곤
	{ ID = 70, Ratio = { 1, 1, 1}, }, -- 광폭한 고르곤
	{ ID = 71, Ratio = { 2, 2, 2}, }, -- 블래게어리 퀸
	{ ID = 72, Ratio = { 2, 2, 2}, }, -- 오크로드
	{ ID = 73, Ratio = { 3, 3, 3}, }, -- 다크 아몬
	{ ID = 74, Ratio = { 0.9, 0.9, 0.9}, }, -- 원주민 창병
	{ ID = 75, Ratio = { 1, 1, 1}, }, -- 원주민 족장
	{ ID = 76, Ratio = { 1.2, 1.2, 1.2}, }, -- 비홀더
	{ ID = 77, Ratio = { 1.2, 1.2, 1.2}, }, -- 변이 스켈레톤
	{ ID = 78, Ratio = { 1, 1, 1}, }, -- 이끼괴수
	{ ID = 79, Ratio = { 3, 3, 3}, }, -- 레나시엔 (중보)
	{ ID = 80, Ratio = { 3, 3, 3}, }, -- 옥투스 (중보)
	{ ID = 81, Ratio = { 2, 2, 2}, }, -- 파투세이 (머리)
	{ ID = 82, Ratio = { 2, 2, 2}, }, -- 어둠의 고르고스
	{ ID = 83, Ratio = { 2, 2, 2}, }, -- 어둠의 트롤
	{ ID = 84, Ratio = { 1, 1, 1}, }, -- 파투세이 (몸)
	{ ID = 85, Ratio = { 1, 1, 1}, }, -- 파투세이 (다리)
	{ ID = 86, Ratio = { 1, 1, 1}, }, -- 주니어 식충식물
	{ ID = 87, Ratio = { 0.9, 0.9, 0.9}, }, -- 파라미니미
	{ ID = 88, Ratio = { 2, 2, 2}, }, -- 엔트
	{ ID = 89, Ratio = { 2.4, 2.4, 2.4}, }, -- 웬디
	{ ID = 90, Ratio = { 2.8, 2.8, 2.8}, }, -- 오크전사
	{ ID = 91, Ratio = { 3.2, 3.2, 3.2}, }, -- 하피퀸
	{ ID = 92, Ratio = { 3.6, 3.6, 3.6}, }, -- 오크로드
	{ ID = 93, Ratio = { 4, 4, 4}, }, -- 레드고르고스
	{ ID = 94, Ratio = { 4.4, 4.4, 4.4}, }, -- 트롤
	{ ID = 95, Ratio = { 4.8, 4.8, 4.8}, }, -- 자이언트 드릴몬
	{ ID = 96, Ratio = { 5.2, 5.2, 5.2}, }, -- 엘리자베스
	{ ID = 97, Ratio = { 5.6, 5.6, 5.6}, }, -- 리치
	{ ID = 98, Ratio = { 6, 6, 6}, }, -- 파라돔
	{ ID = 99, Ratio = { 6.4, 6.4, 6.4}, }, -- 가이코즈
	{ ID = 100, Ratio = { 6.8, 6.8, 6.8}, }, -- 파투세이
	{ ID = 101, Ratio = { 7.2, 7.2, 7.2}, }, -- 파투세이
	{ ID = 102, Ratio = { 7.6, 7.6, 7.6}, }, -- 파투세이
	{ ID = 103, Ratio = { 8, 8, 8}, }, -- 카미키
	{ ID = 104, Ratio = { 8.4, 8.4, 8.4}, }, -- 바실리스크
	{ ID = 105, Ratio = { 8.8, 8.8, 8.8}, }, -- 가도센
	{ ID = 106, Ratio = { 9.2, 9.2, 9.2}, }, -- 진 카제아제
	{ ID = 107, Ratio = { 9.6, 9.6, 9.6}, }, -- 사이클롭스
	{ ID = 108, Ratio = { 10, 10, 10}, }, -- 자이언트 스톤골렘
	{ ID = 109, Ratio = { 10.4, 10.4, 10.4}, }, -- 다크아몬
	{ ID = 111, Ratio = { 10.8, 10.8, 10.8}, }, -- 옥투스
	{ ID = 112, Ratio = { 0.9, 0.9, 0.9}, }, -- 광신도 폭탄병
	{ ID = 113, Ratio = { 1.1, 1.1, 1.1}, }, -- 광신도 방패병
	{ ID = 114, Ratio = { 1.1, 1.1, 1.1}, }, -- 광신도 승려
	{ ID = 115, Ratio = { 1, 1, 1}, }, -- 가시몬
	{ ID = 116, Ratio = { 1, 1, 1}, }, -- 바네사
	{ ID = 117, Ratio = { 2, 2, 2}, }, -- 바네사 (늑대)
	{ ID = 118, Ratio = { 3, 3, 3}, }, -- 순환의 신
	{ ID = 119, Ratio = { 3, 3, 3}, }, -- 레나시엔
	{ ID = 120, Ratio = { 3, 3, 3}, }, -- 옥투스
	{ ID = 125, Ratio = { 1.1, 1.1, 1.1}, }, -- 나가몬
	{ ID = 126, Ratio = { 1, 1, 1}, }, -- 어쌔신 검술사
	{ ID = 127, Ratio = { 0.9, 0.9, 0.9}, }, -- 어쌔신 순찰자
	{ ID = 128, Ratio = { 2, 2, 2}, }, -- 아스타롯
	{ ID = 129, Ratio = { 3, 3, 3}, }, -- 불타로스
	{ ID = 130, Ratio = { 0.75, 0.75, 0.75}, }, -- 저주받은 마나석
	{ ID = 132, Ratio = { 0.9, 0.9, 0.9}, }, -- 비스트모스키토
	{ ID = 133, Ratio = { 1, 1, 1}, }, -- 독거미
	{ ID = 134, Ratio = { 1.1, 1.1, 1.1}, }, -- 엔트미니미
	{ ID = 135, Ratio = { 2, 2, 2}, }, -- 변질된 엔트
	{ ID = 136, Ratio = { 3, 3, 3}, }, -- 에이션트 엔트
	{ ID = 137, Ratio = { 1, 1, 1}, }, -- 불거미
	{ ID = 138, Ratio = { 1, 1, 1}, }, -- 해골격투가
	{ ID = 140, Ratio = { 3, 3, 3}, }, -- 블랙페어리 퀸
	{ ID = 141, Ratio = { 1, 1, 1}, }, -- 캐스터 랍스터
	{ ID = 142, Ratio = { 1.2, 1.2, 1.2}, }, -- 전기아귀
	{ ID = 143, Ratio = { 4, 4, 4}, }, -- 크라코
	{ ID = 144, Ratio = { 3, 3, 3}, }, -- 지그
	{ ID = 145, Ratio = { 1.2, 1.2, 1.2}, }, -- 해머몬
	{ ID = 146, Ratio = { 1, 1, 1}, }, -- 켄크르
	{ ID = 147, Ratio = { 0.9, 0.9, 0.9}, }, -- 로쉐
	{ ID = 148, Ratio = { 2, 2, 2}, }, -- 산호몬
	{ ID = 149, Ratio = { 1.5, 1.5, 1.5}, }, -- 에메랄드 랍스터
	{ ID = 150, Ratio = { 1.1, 1.1, 1.1}, }, -- 마그몬
	{ ID = 151, Ratio = { 1, 1, 1}, }, -- 습지대 고블린
	{ ID = 152, Ratio = { 1.2, 1.2, 1.2}, }, -- 바이올렛 페어리
	{ ID = 153, Ratio = { 1, 1, 1}, }, -- 바이올렛 픽시
	{ ID = 154, Ratio = { 0.9, 0.9, 0.9}, }, -- 안개 정령
	{ ID = 155, Ratio = { 2, 2, 2}, }, -- 미스틱 골렘
	{ ID = 156, Ratio = { 3, 3, 3}, }, -- 하스
	{ ID = 158, Ratio = { 1, 1, 1}, }, -- 포이즌 모스키토
	{ ID = 159, Ratio = { 1, 1, 1}, }, -- 미니 독충식물
	{ ID = 160, Ratio = { 1.2, 1.2, 1.2}, }, -- 독거미 여왕
	{ ID = 161, Ratio = { 0.75, 0.75, 0.75}, }, -- 새끼 독거미
	{ ID = 162, Ratio = { 2, 2, 2}, }, -- 블랙 웬디
	{ ID = 163, Ratio = { 3, 3, 3}, }, -- 앙뜨와네트
	{ ID = 164, Ratio = { 1, 1, 1}, }, -- 프리징 세이버투스
	{ ID = 165, Ratio = { 0.9, 0.9, 0.9}, }, -- 프리징 켄크르
	{ ID = 166, Ratio = { 1.2, 1.2, 1.2}, }, -- 엔다리온
	{ ID = 167, Ratio = { 2, 2, 2}, }, -- 샤크아론
	{ ID = 168, Ratio = { 3, 3, 3}, }, -- 쥬리오르
	{ ID = 169, Ratio = { 1, 1, 1}, }, -- 성난피바람 오크
	{ ID = 170, Ratio = { 1.1, 1.1, 1.1}, }, -- 성난피바람 오크전사
	{ ID = 171, Ratio = { 1.2, 1.2, 1.2}, }, -- 마그마 파라돔
	{ ID = 172, Ratio = { 2, 2, 2}, }, -- 타이타로스
	{ ID = 173, Ratio = { 3, 3, 3}, }, -- 드레이크 웜
	{ ID = 174, Ratio = { 0.8, 0.8, 0.8}, }, -- 자이언트 웜
	{ ID = 175, Ratio = { 1.2, 1.2, 1.2}, }, -- DK Mark-I
	{ ID = 176, Ratio = { 1, 1, 1}, }, -- 미스톤
	{ ID = 177, Ratio = { 3, 3, 3}, }, -- 거인
	{ ID = 178, Ratio = { 3, 3, 3}, }, -- 페리어트
	{ ID = 179, Ratio = { 0.75, 0.75, 0.75}, }, -- 마그마 파라돔 (자폭)
	{ ID = 181, Ratio = { 1, 1, 1}, }, -- 블랙나이츠 방패병
	{ ID = 182, Ratio = { 1, 1, 1}, }, -- 블랙나이츠 창병
	{ ID = 183, Ratio = { 1.1, 1.1, 1.1}, }, -- 하급 암흑사제
	{ ID = 184, Ratio = { 2, 2, 2}, }, -- 블랙 템페스트
	{ ID = 185, Ratio = { 1, 1, 1}, }, -- 빅터 (Phase 1)
	{ ID = 186, Ratio = { 3, 3, 3}, }, -- 빅터 (Phase 2)
	{ ID = 187, Ratio = { 1, 1, 1}, }, -- 독가시 넝쿨몬
	{ ID = 188, Ratio = { 0.9, 0.9, 0.9}, }, -- 디코이
	{ ID = 189, Ratio = { 1.3, 1.3, 1.3}, }, -- 우덴
	{ ID = 190, Ratio = { 1.2, 1.2, 1.2}, }, -- DK Mark-II
	{ ID = 191, Ratio = { 0.5, 0.5, 0.5}, }, -- 독가시 넝쿨몬 (보스방)
	{ ID = 192, Ratio = { 3, 3, 3}, }, -- 신목
	{ ID = 193, Ratio = { 2, 2, 2}, }, -- 신목 가지 1
	{ ID = 194, Ratio = { 2, 2, 2}, }, -- 신목 가지 2
	{ ID = 195, Ratio = { 2, 2, 2}, }, -- 신목 가지 3
	{ ID = 196, Ratio = { 2, 2, 2}, }, -- 신목 가지 4
	{ ID = 197, Ratio = { 2, 2, 2}, }, -- 다크 스톰
	{ ID = 198, Ratio = { 2, 2, 2}, }, -- 퓨리어스 스톰
	{ ID = 199, Ratio = { 0.5, 0.5, 0.5}, }, -- 가고일 공병
	{ ID = 200, Ratio = { 0.8, 0.8, 0.8}, }, -- 가고일
	{ ID = 201, Ratio = { 1, 1, 1}, }, -- 사타니엘 전사
	{ ID = 202, Ratio = { 1.1, 1.1, 1.1}, }, -- 상급 암흑사제
	{ ID = 203, Ratio = { 1.2, 1.2, 1.2}, }, -- 헤라
	{ ID = 204, Ratio = { 3, 3, 3}, }, -- 이블리스
	{ ID = 205, Ratio = { 1, 1, 1}, }, -- 이블리스 나이트
	{ ID = 206, Ratio = { 2, 2, 2}, }, -- 타나토스 (Phase 1)
	{ ID = 207, Ratio = { 3, 3, 3}, }, -- 타나토스 (Phase 2)
	{ ID = 208, Ratio = { 4, 4, 4}, }, -- 타나토스 (Phase 3)
	{ ID = 210, Ratio = { 0.9, 0.9, 0.9}, }, -- 조약돌 고블린
	{ ID = 211, Ratio = { 1, 1, 1}, }, -- 조약돌 고블린 싸움꾼
	{ ID = 212, Ratio = { 1.1, 1.1, 1.1}, }, -- 조약돌 고블린 노역꾼
	{ ID = 213, Ratio = { 2, 2, 2}, }, -- 브루터스
	{ ID = 214, Ratio = { 1.1, 1.1, 1.1}, }, -- 천년 사도
	{ ID = 215, Ratio = { 3, 3, 3}, }, -- 세태쉬
	{ ID = 216, Ratio = { 0.9, 0.9, 0.9}, }, -- 일꾼 깨미
	{ ID = 217, Ratio = { 1, 1, 1}, }, -- 병정 깨미
	{ ID = 218, Ratio = { 1.2, 1.2, 1.2}, }, -- 대장 깨미
	{ ID = 219, Ratio = { 0.9, 0.9, 0.9}, }, -- 검방이
	{ ID = 220, Ratio = { 2, 2, 2}, }, -- 스콜피스
	{ ID = 221, Ratio = { 3, 3, 3}, }, -- 하셉수트
	{ ID = 222, Ratio = { 0.9, 0.9, 0.9}, }, -- 쿵지
	{ ID = 224, Ratio = { 1, 1, 1}, }, -- 매직 쿵
	{ ID = 225, Ratio = { 1.1, 1.1, 1.1}, }, -- 빅 쿵
	{ ID = 226, Ratio = { 2, 2, 2}, }, -- 가디언 쿵
	{ ID = 227, Ratio = { 3, 3, 3}, }, -- 엘더 쿵
	{ ID = 228, Ratio = { 1, 1, 1}, }, -- 암흑숲 정찰자
	{ ID = 229, Ratio = { 1, 1, 1}, }, -- 암흑숲 암살자
	{ ID = 230, Ratio = { 1, 1, 1}, }, -- 불망치 대장장이
	{ ID = 231, Ratio = { 0.9, 0.9, 0.9}, }, -- 불망치 토치맨
	{ ID = 232, Ratio = { 1.2, 1.2, 1.2}, }, -- 불망치 버서커
	{ ID = 233, Ratio = { 2, 2, 2}, }, -- 스파이더 가드머신
	{ ID = 235, Ratio = { 3, 3, 3}, }, -- 탈린 풀가드 (전차)
	{ ID = 241, Ratio = { 0.9, 0.9, 0.9}, }, -- 모래 일꾼 깨미
	{ ID = 242, Ratio = { 1, 1, 1}, }, -- 모래 병정 깨미
	{ ID = 243, Ratio = { 1.1, 1.1, 1.1}, }, -- 스콜핑
	{ ID = 244, Ratio = { 1.1, 1.1, 1.1}, }, -- 프릴자드
	{ ID = 245, Ratio = { 2, 2, 2}, }, -- 자이언트 프릴자드
	{ ID = 246, Ratio = { 3, 3, 3}, }, -- 샌드룰러
	{ ID = 247, Ratio = { 1.1, 1.1, 1.1}, }, -- 불망치 드릴러
	{ ID = 248, Ratio = { 0.9, 0.9, 0.9}, }, -- 강철 드워프 공병
	{ ID = 249, Ratio = { 1, 1, 1}, }, -- 강철 드워프 감독관
	{ ID = 250, Ratio = { 2, 2, 2}, }, -- 파워 셔블
	{ ID = 251, Ratio = { 2, 2, 2}, }, -- 센트리 키퍼 1호
	{ ID = 252, Ratio = { 2, 2, 2}, }, -- 센트리 키퍼 2호
	{ ID = 256, Ratio = { 0.75, 0.75, 0.75}, }, -- 파투세이 창
	{ ID = 257, Ratio = { 0.9, 0.9, 0.9}, }, -- 테크니컬 가드
	{ ID = 258, Ratio = { 1, 1, 1}, }, -- 썬더 해머 소총병
	{ ID = 259, Ratio = { 1, 1, 1}, }, -- 썬더 해머 저격병
	{ ID = 260, Ratio = { 1.1, 1.1, 1.1}, }, -- 썬더 해머 수호병
	{ ID = 261, Ratio = { 1.5, 1.5, 1.5}, }, -- 로얄 가드
	{ ID = 262, Ratio = { 2, 2, 2}, }, -- 암흑 밀사
	{ ID = 263, Ratio = { 1, 1, 1}, }, -- 블루 슬라임
	{ ID = 264, Ratio = { 1, 1, 1}, }, -- 레드 슬라임
	{ ID = 265, Ratio = { 1, 1, 1}, }, -- 그린 슬라임
	{ ID = 266, Ratio = { 1.2, 1.2, 1.2}, }, -- 포이즌 머쉬룸
	{ ID = 267, Ratio = { 1, 1, 1}, }, -- 무법자 꽃게
	{ ID = 268, Ratio = { 1, 1, 1}, }, -- 꿀꺼비
	{ ID = 269, Ratio = { 1, 1, 1}, }, -- 원령 무사
	{ ID = 270, Ratio = { 1, 1, 1}, }, -- 원령 총사
	{ ID = 271, Ratio = { 1.1, 1.1, 1.1}, }, -- 제사장
	{ ID = 272, Ratio = { 2, 2, 2}, }, -- 수신장
	{ ID = 273, Ratio = { 1.1, 1.1, 1.1}, }, -- 좀비오크투척병
	{ ID = 276, Ratio = { 1, 1, 1}, }, -- 솔저 가드머신
	{ ID = 277, Ratio = { 2, 2, 2}, }, -- 듀엘
	{ ID = 278, Ratio = { 3, 3, 3}, }, -- 아론
	{ ID = 281, Ratio = { 2, 1, 1}, }, -- 스톤 골렘
	{ ID = 282, Ratio = { 2, 1, 1}, }, -- 아이스 골렘
	{ ID = 283, Ratio = { 2, 1, 1}, }, -- 파이어 골렘
	{ ID = 284, Ratio = { 2, 1, 1}, }, -- 황금의 가이코즈
	{ ID = 285, Ratio = { 2, 1, 1}, }, -- 마령의 카미키
	{ ID = 286, Ratio = { 2, 1, 1}, }, -- 지옥의 가도센
	{ ID = 287, Ratio = { 3, 1, 1}, }, -- 플레임 바실리스크
	{ ID = 288, Ratio = { 3, 1, 1}, }, -- 프로스트 바실리스크
	{ ID = 289, Ratio = { 5, 1, 1}, }, -- 네모필라
	{ ID = 290, Ratio = { 0, 0, 0}, }, -- 스테이지 오브젝트
	{ ID = 291, Ratio = { 0, 0, 0}, }, -- 나약한 건트
	{ ID = 292, Ratio = { 0, 0, 0}, }, -- 강인한 건트
	{ ID = 293, Ratio = { 0, 0, 0}, }, -- 네모필라 영혼
	{ ID = 294, Ratio = { 2, 1, 1}, }, -- 지옥병
	{ ID = 295, Ratio = { 2, 1, 1}, }, -- 지옥 수인
	{ ID = 296, Ratio = { 2, 1, 1}, }, -- 지옥 군단병
	{ ID = 297, Ratio = { 0, 0, 0}, }, -- 지옥 군단병 변신변신
	{ ID = 298, Ratio = { 2, 1, 1}, }, -- 지옥사제
	{ ID = 299, Ratio = { 3, 1, 1}, }, -- 데스웜
	{ ID = 300, Ratio = { 5, 1, 1}, }, -- 불카누스
}	
